[
    {
        "title": "Commutr",
        "image": "./Commutr.jpg",
        "url": "https://devpost.com/software/commutr-gs3aro",
        "description": "Get the latest news, chat with fellow commuters, and receive updates on transit status. Built on a unique online-offline infrastructure."
    },
    {
        "title": "upFoot",
        "image": "./upFoot.jpg",
        "url": "https://devpost.com/software/traffic-ihl1je",
        "description": "A IoT sensor for foot traffic, interfacing with Slack and Airtable. Built with an ESP8266 microcontroller and a StdLib web service backend."
    },
    {
        "title": "ShareTO",
        "image": "./ShareTO.png",
        "url": "https://devpost.com/software/shareto",
        "description": "A modern geolocation-based online marketplace for the sharing economy. Built using Angular, Java and MongoDB. Hosted on Google Cloud Platform."
    },
    {
        "title": "ChessEngine",
        "image": "./ChessEngine.jpg",
        "url": "https://github.com/alainlou/ChessEngine",
        "description": "A Universal Chess Interface compatible chess engine, written in Python. Uses Minimax search with Alpha-Beta pruning and piece-square tables."
    },
    {
        "title": "CustomArduino",
        "image": "./CustomArduino.jpg",
        "url": "https://github.com/alainlou/CustomArduino",
        "description": "A redesigned Arduino microcontroller board, from the open source spec. My first project with KiCad and soldering SMT components."
    },
    {
        "title": "LM386 Amp",
        "image": "./LM386.jpg",
        "url": "https://github.com/alainlou/lm386-audio-amp",
        "description": "Op-amp circuit based on LM386 chip from Texas Instruments. Powerful enough to drive my electric guitar. Circuit design, layout, and soldering."
    },
    {
        "title": "LearnBach",
        "image": "./LearnBach.jpg",
        "url": "https://github.com/alainlou/LearnBach",
        "description": "Python scripts for training a neural network to compose baroque-style keyboard music. Conversion between MIDI, .txt, and .csv. File retrieval with requests library."
    },
    {
        "title": "DineSafe",
        "image": "./DineSafe.png",
        "url": "https://github.com/SQUASHer42/dinesafe",
        "description": "Android app that uses restaurant inspection data from OpenData to recommend dining options for users. Java backend with IBM Cloudant database."
    }
]